nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>DMD_WAVE6_REG1</name>
          <description>PHY Demodulator Wave6 Register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x82C8100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 6 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 6 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 6 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 6 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 6 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE6_REG2</name>
          <description>PHY Demodulator Wave6 Register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 6 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 6 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 6 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG0</name>
          <description>PHY Demodulator Wave7 Register 0</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3CE35C6D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 7 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 7 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 7 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 7 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 7 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG1</name>
          <description>PHY Demodulator Wave7 Register 1</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF2C8100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 7 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 7 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 7 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 7 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 7 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG2</name>
          <description>PHY Demodulator Wave7 Register 2</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1B5D3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 7 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 7 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 7 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMDAA_CTRL</name>
          <description>PHY Demodulator Based SFD Confirmation control register.</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMDAA_HAMM_LP</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match in low power case; valid range [0,7].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMDAA_HAMM_HP</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match in high power case; valid range [0,7].</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPOW_DIS_OVRD</name>
              <description>Override the feature: disable DMDAA when power sensitivity is higher;</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable override, DMDAA disabled when power is high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable override, DMDAA enabled when power is high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMDAA_EN</name>
              <description>Enables Demodulator Based SFD Confirmation;</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_STAT</name>
          <description>High resolution Time-Of-Flight calculation Status.</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x54010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTT_CFO</name>
              <description>The high accuracy CFO computed by the HARTT block through the CORDIC algorithm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_P_DELTA</name>
              <description>Difference between the squared correlation magnitude values, pm-pp provided by the HARTT block, format is sfix10En9.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_DIST_SAT</name>
              <description>Computed Hamming distance saturated to 2 bits, format is ufix2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_INT_ADJ</name>
              <description>An integer adjustment of the timing which takes a value different of 0 when the early-late mechanism in the HARTT block chooses a peak different of the one chosen in the acquisition module (possible values are {-1,0,+1}).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTT_FOUND</name>
              <description>Flag that indicates that the HARTT operation is done and a valid PN pattern was detected.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_CTRL</name>
          <description>PHY RTT control register.</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4166</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HA_RTT_THRESHOLD</name>
              <description>threshold used to validate a HA RTT result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIRST_PDU_BIT</name>
              <description>Programmed by software - used for regular packets high accuracy RTT; First PDU bit gets programmed into this field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTT_SEQ_LEN</name>
              <description>Allow PHY Demodulation during RTT computation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERRD_PROGR_AA</name>
              <description>Enables overriding the programmed AA bits with the PN sequence used by RTT;</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HIGH_ACC_RTT</name>
              <description>enables the use of the HA RTT block;</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTT_REF</name>
          <description>PHY RTT reference register.</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x806348</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FM_REF_010</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FM_REF_110</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FM_REF_111</name>
              <description>Contextual values used to derive the FM reference ha_rtt_threshold .</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
