nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_TSM</name>
      <description>XCVR_TSM</description>
      <groupName>XCVR_TSM</groupName>
      <baseAddress>0x40107800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x130</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>TSM CONTROL</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SOFT_RESET</name>
              <description>TSM Soft Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_SOFT_RESET_0</name>
                  <description>TSM Soft Reset removed. Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_SOFT_RESET_1</name>
                  <description>TSM Soft Reset engaged. TSM forced to IDLE, and holds there until the bit is cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_TX_EN</name>
              <description>Force Transmit Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_TX_EN_0</name>
                  <description>TSM Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_TX_EN_1</name>
                  <description>TSM executes a TX sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_RX_EN</name>
              <description>Force Receive Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_RX_EN_0</name>
                  <description>TSM Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_RX_EN_1</name>
                  <description>TSM executes a RX sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_ABORT_DIS</name>
              <description>Transmit Abort Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ABORT_DIS</name>
              <description>Receive Abort Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABORT_ON_CTUNE</name>
              <description>Abort On Coarse Tune Lock Detect Failure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT_ON_CTUNE_0</name>
                  <description>don't allow TSM abort on Coarse Tune Unlock Detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT_ON_CTUNE_1</name>
                  <description>allow TSM abort on Coarse Tune Unlock Detect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABORT_ON_FREQ_TARG</name>
              <description>Abort On Frequency Target Lock Detect Failure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT_ON_FREQ_TARG_0</name>
                  <description>don't allow TSM abort on Frequency Target Unlock Detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT_ON_FREQ_TARG_1</name>
                  <description>allow TSM abort on Frequency Target Unlock Detect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_IRQ0_EN</name>
              <description>TSM_IRQ0 Enable/Disable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ0_EN_0</name>
                  <description>TSM_IRQ0 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ0_EN_1</name>
                  <description>TSM_IRQ0 is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_IRQ1_EN</name>
              <description>TSM_IRQ1 Enable/Disable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ1_EN_0</name>
                  <description>TSM_IRQ1 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ1_EN_1</name>
                  <description>TSM_IRQ1 is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_UNLOCK_IRQ_EN</name>
              <description>PLL Unlock Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_UNLOCK_IRQ_EN_0</name>
                  <description>allows PLL unlock event to generate an interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_UNLOCK_IRQ_EN_1</name>
                  <description>A PLL unlock event will set the PLL_UNLOCK_IRQ status bit, but an interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_UNLOCK_IRQ</name>
              <description>PLL Unlock IRQ</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_UNLOCK_IRQ_0</name>
                  <description>A PLL Unlock Interrupt has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_UNLOCK_IRQ_1</name>
                  <description>A PLL Unlock Interrupt has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_LL_INHIBIT</name>
              <description>TSM Per-Link-Layer Inhibit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_ACTIVE_EXTEND</name>
              <description>TSM RF_ACTIVE Extension Duration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPT</name>
              <description>TSM Breakpoint</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPS_CTRL</name>
          <description>TSM CONTROL</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPPS_LNA_MIX_ALLOW</name>
              <description>LPPS_LNA_MIX_ALLOW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_CBPF_ALLOW</name>
              <description>LPPS_CBPF_ALLOW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_ADC_ALLOW</name>
              <description>LPPS_ADC_ALLOW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_LO_RX_ALLOW</name>
              <description>LPPS_LO_RX_ALLOW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_LO_RXDRV_ALLOW</name>
              <description>LPPS_LO_RXDRV_ALLOW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_RX_DIG_ALLOW</name>
              <description>LPPS_RX_DIG_ALLOW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_RX_PHY_ALLOW</name>
              <description>LPPS_RX_PHY_ALLOW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_START_RX</name>
              <description>LPPS Fast TSM RX Warmup &quot;Jump-from&quot; Point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_DEST_RX</name>
              <description>LPPS Fast TSM RX Warmup &quot;Jump-to&quot; Point</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>END_OF_SEQ</name>
          <description>TSM END OF SEQUENCE</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C5A7270</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>END_OF_TX_WU</name>
              <description>End of TX Warmup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END_OF_TX_WD</name>
              <description>End of TX Warmdown</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END_OF_RX_WU</name>
              <description>End of RX Warmup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END_OF_RX_WD</name>
              <description>End of RX Warmdown</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WU_LATENCY</name>
          <description>WARMUP LATENCY</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DATAPATH_LATENCY</name>
              <description>TX Datapath Latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SETTLING_LATENCY</name>
              <description>RX Settling Latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECYCLE_COUNT</name>
          <description>TSM RECYCLE COUNT</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2A1258</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECYCLE_COUNT0</name>
              <description>TSM RX Recycle Count 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYCLE_COUNT1</name>
              <description>TSM RX Recycle Count 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYCLE_COUNT2</name>
              <description>TSM RX Recycle Count 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_CTRL1</name>
          <description>TSM FAST WARMUP CONTROL 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_TX_WU_EN</name>
              <description>Fast TSM TX Warmup Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_TX_WU_EN_0</name>
                  <description>Fast TSM TX Warmups are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_TX_WU_EN_1</name>
                  <description>Fast TSM TX Warmups are enabled, if the RF channel has not changed since the last TX warmup, and for Bluetooth LE mode, the RF channel is not an advertising channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX_WU_EN</name>
              <description>Fast TSM RX Warmup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_RX_WU_EN_0</name>
                  <description>Fast TSM RX Warmups are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_RX_WU_EN_1</name>
                  <description>Fast TSM RX Warmups are enabled, if the RF channel has not changed since the last RX warmup, and for Bluetooth LE mode, the RF channel is not an advertising channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX2TX_EN</name>
              <description>Fast TSM RX-to-TX Transition Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_RX2TX_EN_0</name>
                  <description>Disable Fast RX-to-TX transitions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_RX2TX_EN_1</name>
                  <description>Enable Fast RX-to-TX transitions (if fast_rx2tx_wu is asserted by the Link Layer)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSAVE_TX_WU_EN</name>
              <description>Power Save TSM TX Warmup Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRSAVE_TX_WU_EN_0</name>
                  <description>PowerSave TSM TX Warmups are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRSAVE_TX_WU_EN_1</name>
                  <description>PowerSave TSM TX Warmups are enabled, if the RF channel has not changed since the last TX warmup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSAVE_RX_WU_EN</name>
              <description>Power Save TSM RX Warmup Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRSAVE_RX_WU_EN_0</name>
                  <description>PowerSave TSM RX Warmups are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRSAVE_RX_WU_EN_1</name>
                  <description>PowerSave TSM RX Warmups are enabled, if the RF channel has not changed since the last RX warmup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSAVE_WU_CLEAR</name>
              <description>PowerSave TSM Warmup Clear State</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RX2TX_START</name>
              <description>TSM &quot;Jump-to&quot; point for a Fast TSM RX-to-TX Transition.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_TX2RX_EN</name>
              <description>Fast TSM TX-to-RX Transition Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_TX2RX_EN_0</name>
                  <description>Disable Fast TX-to-RX transitions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_TX2RX_EN_1</name>
                  <description>Enable Fast TX-to-RX transitions (if fast_tx2rx_wu is asserted by Ranging sequence manager)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_TX2RX_START</name>
              <description>TSM &quot;Jump-to&quot; point for a Fast TSM TX-to-RX Transition.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_CTRL2</name>
          <description>TSM FAST WARMUP CONTROL 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_START_TX</name>
              <description>Fast TSM TX &quot;Jump-from&quot; Point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_DEST_TX</name>
              <description>Fast TSM TX &quot;Jump-to&quot; Point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_START_RX</name>
              <description>Fast TSM RX &quot;Jump-from&quot; Point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_DEST_RX</name>
              <description>Fast TSM RX &quot;Jump-to&quot; Point</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
