nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>RX_0</name>
          <description>RF Analog RX Control0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_LNA_ITRIM</name>
              <description>reg_rx_lna_itrim_dig[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_0</name>
                  <description>3.7u -25%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_1</name>
                  <description>4.4u -15%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_2</name>
                  <description>5.1u Default</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_3</name>
                  <description>5.6u +10%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_LNA_PTAT_FORCE_START</name>
              <description>reg_rtfe_ptat_force_dig</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MIX_VBIAS</name>
              <description>reg_rx_mix_vbias_dig[1:0]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_0</name>
                  <description>0.800V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_1</name>
                  <description>0.742V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_2</name>
                  <description>0.689V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_3</name>
                  <description>0.857V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TRIM</name>
              <description>reg_adc_trim_dig[1:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TRIM_0</name>
                  <description>0.965V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_1</name>
                  <description>0.935V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_2</name>
                  <description>0.905V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_3</name>
                  <description>0.875V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_INVERT_CLK</name>
              <description>reg_adc_invert_clk_dig</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_INVERT_CLK_0</name>
                  <description>not invert clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_INVERT_CLK_1</name>
                  <description>invert clk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_1</name>
          <description>RF Analog RX Control1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x22008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_TYPE</name>
              <description>reg_cbpf_type_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TYPE_0</name>
                  <description>Real</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TYPE_1</name>
                  <description>Complex,</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_I</name>
              <description>reg_cbpf_trim_i_dig[1:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_0</name>
                  <description>5u (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_1</name>
                  <description>6.25u</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_2</name>
                  <description>7.5u</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_3</name>
                  <description>8.75u</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_Q</name>
              <description>reg_cbpf_trim_q_dig[1:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_0</name>
                  <description>5u (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_1</name>
                  <description>6.25u</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_2</name>
                  <description>7.5u</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_3</name>
                  <description>8.75u</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_VCM_TRIM</name>
              <description>reg_cbpf_vcm_trim_dig[1:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_0</name>
                  <description>480mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_1</name>
                  <description>453mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_2</name>
                  <description>426mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_3</name>
                  <description>401mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_SHORT_DCBIAS</name>
              <description>reg_cbpf_trim_short_dcbias_dig[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_0</name>
                  <description>470mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_1</name>
                  <description>438mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_2</name>
                  <description>413mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_3</name>
                  <description>385mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_DAC_PA</name>
          <description>RF Analog TX DAC PA Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAC_INVERT_CLK</name>
              <description>reg_dac_invert_clk_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_TRIM_RLOAD</name>
              <description>reg_dac_trim_rload_dig[1:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_0</name>
                  <description>3K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_1</name>
                  <description>2.25K</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_2</name>
                  <description>3.75K</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_3</name>
                  <description>4.5K</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC_TRIM_IBIAS</name>
              <description>reg_dac_trim_ibias_dig[1:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_0</name>
                  <description>3.0uA (I_lsb=250nA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_1</name>
                  <description>2.5uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_2</name>
                  <description>3.8uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_3</name>
                  <description>5.0uA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_PA_VBIAS</name>
              <description>reg_tx_pa_vbias_dig[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_0</name>
                  <description>0.460V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_1</name>
                  <description>0.431V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_2</name>
                  <description>0.403V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_3</name>
                  <description>0.375V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PA_SMOOTHER_EN</name>
              <description>reg_pa_smoother_en_dig</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PA_SMOOTHER_EN_0</name>
                  <description>PA_SMOOTHER disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA_SMOOTHER_EN_1</name>
                  <description>PA_SMOOTHER enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PA_SMOOTHER_CUR</name>
              <description>reg_pa_smoother_cur_dig[2:0]</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_TRIM_CFBK</name>
              <description>reg_dac_trim_cfbk_dig[1:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_0</name>
                  <description>675fF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_1</name>
                  <description>1.35pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_2</name>
                  <description>1.35pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_3</name>
                  <description>2.025pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC_TRIM_CFBK_DRS</name>
              <description>reg_dac_trim_cfbk_dig[1:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_0</name>
                  <description>675fF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_1</name>
                  <description>1.35pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_2</name>
                  <description>1.35pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_3</name>
                  <description>2.025pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
