nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>ble_reg_hw_abort_sts</name>
          <description>BLE Interrupt Status; hardware Abort</description>
          <addressOffset>0x74C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>ble_deny_sts</name>
              <description>ble_deny_sts interrupt, RIF arbiter has denied BLE packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_cutoff_sts</name>
              <description>ble_cutoff_sts interrupt, RIF ARB has cut off BLE packet.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_bcadeny_sts</name>
              <description>ble_bcadeny_sts interrupt, BCA has denied BLE packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_bcacutoff_sts</name>
              <description>ble_bcacutoff_sts interrupt, BCA has cut off BLE packet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cor_timeout_intr_sts</name>
              <description>cor_timeout_intr_sts interrupt, Correlation timeout condition has occurred.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_sync_pulse_timeout_intr_sts</name>
              <description>rx_sync_pulse_timeout_intr_sts interrupt, Sync timeout condition has occurred.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_datavld_timeout_intr_sts</name>
              <description>rx_datavld_timeout_intr_sts interrupt, PDU Rx data valid timeout condition has occurred. Bursting Mode only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>txrx_error_sts</name>
              <description>txrx_error_sts interrupt, one of tx_lock_fail_intr; rx_lock_fail_intr; or rx_length_err_intr interrupt has been asserted.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_sw_abort_b4_a2_sts</name>
              <description>If ble_reg_sw_abort happens during ongoing BLE packet and before dbus A2; ble_sw_abort_b4_a2_sts is issued</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_sw_abort_after_a2_sts</name>
              <description>If ble_reg_sw_abort happens while ongoing BLE transaction and after dbus A2; ble_sw_abort_after_a2_sts is issued</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_cca_abort_sts</name>
              <description>When CCA is enabled on TX; and it results in an abort indication from BRF; ble_cca_abort_sts is issued</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_cca_abort_thd_met_sts</name>
              <description>Aborts on atleast one channel have met or exceeded the programmed threshold value in ble_cca_abort_pkt_cnt_thd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_cca_txpkt_thd_met_sts</name>
              <description>Total CCA TX packets on atleast one channel have met or exceeded the programmed threshold value in ble_cca_tx_pkt_cnt_thd</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rt_err_sts</name>
          <description>BLE Interrupt Status; Real-time Error</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>ble_cutoff_intr</name>
              <description>ble_cutoff_intr real-time interrupt, RIF ARB has cut off BLE packet.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_extn_fail_intr</name>
              <description>ble_extn_fail_intr real-time interrupt, Interrupt indicateds extension was not sent or received as expected from the following cases:, 1. Hardware abort condition was detected during extension., 2. BCA deasserted antSwitchStatus signal; meaning it could not honor the the antenna switching pattern that BLE had requested.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ble_bcacutoff_intr</name>
              <description>ble_bcacutoff_intr real-time interrupt, BCA has cut off BLE packet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cor_timeout_intr</name>
              <description>cor_timeout_intr real-time interrupt, Correlation timeout condition has occurred.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_sync_pulse_timeout_intr</name>
              <description>rx_sync_pulse_timeout_intr real-time interrupt, Sync timeout condition has occurred.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_datavld_timeout_intr</name>
              <description>rx_datavld_timeout_intr real-time interrupt, PDU Rx data valid timeout condition has occurred. Bursting Mode only.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_extn_ant_switch_fail_sts</name>
              <description>tx_extn_ant_switch_sts interrupt, BCA antSwitchStatus signal deassertion was occurred during extension transmission.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_extn_abort_sts</name>
              <description>tx_extn_abort_sts interrupt, Hardware abort condition other than antenna switching fail was occurred during extension transmission.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_extn_ant_switch_fail_sts</name>
              <description>rx_extn_ant_switch_sts interrupt, BCA antSwitchStatus signal deassertion was occurred during extension reception.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_extn_abort_sts</name>
              <description>rx_extn_abort_sts interrupt, Hardware abort condition other than antenna switching fail was occurred during extension reception.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_lock_fail_intr</name>
              <description>tx_lock_fail_intr interrupt, Transmit lock fail condition.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_dmem_underflow_intr</name>
              <description>tx_dmem_underflow_intr interrupt, Tx DMA underflow error condition.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_aes_underflow_intr</name>
              <description>tx_aes_underflow_intr interrupt, Tx AES underflow error condition.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_lock_fail_intr</name>
              <description>rx_lock_fail_intr interrupt, Receive lock fail condition</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_dmem_overflow_intr</name>
              <description>rx_dmem_overflow_intr interrupt, Rx DMA overflow error condition.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_aes_underflow_intr</name>
              <description>rx_aes_underflow_intr interrupt, Rx AES underflow error condition.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_length_err_intr</name>
              <description>rx_length_err_intr interrupt, Received packet length error condition.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ahb_error</name>
              <description>ahb_error interrupt, SoC AHB slave has replied ERROR response during BLE AHB master transfer.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_error</name>
              <description>dma_error interrupt, BLE AHB master error condition (startDmaError; gbBeError).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
