nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>ble_reg_tmr_swt_value_1</name>
          <description>Software Timer 1: Expiration Value</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value, Bluetooth native clock value for event generation. When the Bluetooth native clock equals this value; the events are triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_sts_1</name>
          <description>Software Timer 1: Expiration Status</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status, This bit is updated at each expiry. Once set it remains set until this SWT expires again. For the purpose of this register; past value on SWT refers to a value up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed value without any errors, 0x1: SWT was programmed for a value that is in the past</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status, This bit is updated each time the LPO version of nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY be updated with the most accurate value., 0x0: SWT expired at programmed value without any skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration, value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>swt_conf_valid</name>
              <description>SWT Configuration Valid Indication, Indicates when SWT configurations are registered into sleep clock domain Bit is set when configurations are registered in slow domain and reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely registered into slow clock domain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_ctl_2</name>
          <description>Software Timer 2: Control</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timer_en</name>
              <description>Set Timer Enable, This bit is self clearing by hardware after timer expires., 0x0: disable timer, 0x1: enable timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0: no event, 0x1: Tx event triggered at timer expiry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0: no event, 0x1: Rx event triggered at timer expiry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort, Expiration Event Mask for Abort, 0x0: no event, 0x1: Tx/Rx abort triggered at expiry of timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_cs</name>
              <description>Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS transaction to KW PHY, 0x0: no event, 0x1: CS event triggered at timer expiry</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slot_mask</name>
              <description>Slot Mask, This register is a 2 bit LSB mask on the clock comparator. If both bits are cleared; then the events will assert regardless of the matching state of the LSB bits., frame,0x0: timer works on frame basis, 0x1: invalid, slot,0x2: timer works on slot basis, halfslot,0x3: timer works on half slot basis</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>allow_current_expiry</name>
              <description>Allow current SWT expiry with chained CDT; for CDT Matching mode, SWT configuration for new CDT chaining mode. SWT programming with current native clock values would be considered valid; past expiry_status won't be set. SWT expiry events like TX; RX; HW Abort; and CS still cannot be triggered if programming time half slot is &lt;= current native clock. SWT interrupt will also not get generated at such values (since it is too late). Added for KFOURWONE-2451, 0x0: SWT is configured in original mode where current native clock value is, considered to be in the past, 0x1: SWT is configured in new CDT matching mode where current native clock value is, allowed to trigger chained CDTs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_value_2</name>
          <description>Software Timer 2: Expiration Value</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value, Bluetooth native clock value for event generation. When the Bluetooth native clock equals this value; the events are triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_sts_2</name>
          <description>Software Timer 2: Expiration Status</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status, This bit is updated at each expiry. Once set it remains set until this SWT expires again. For the purpose of this register; past value on SWT refers to a value up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed value without any errors, 0x1: SWT was programmed for a value that is in the past</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status, This bit is updated each time the LPO version of nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY be updated with the most accurate value., 0x0: SWT expired at programmed value without any skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration, value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>swt_conf_valid</name>
              <description>SWT Configuration Valid Indication, Indicates when SWT configurations are registered into sleep clock domain Bit is set when configurations are registered in slow domain and reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely registered into slow clock domain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_ctl_3</name>
          <description>Software Timer 3: Control</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timer_en</name>
              <description>Set Timer Enable, This bit is self clearing by hardware after timer expires., 0x0: disable timer, 0x1: enable timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0: no event, 0x1: Tx event triggered at timer expiry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0: no event, 0x1: Rx event triggered at timer expiry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort, Expiration Event Mask for Abort, 0x0: no event, 0x1: Tx/Rx abort triggered at expiry of timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_cs</name>
              <description>Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS transaction to KW PHY, 0x0: no event, 0x1: CS event triggered at timer expiry</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slot_mask</name>
              <description>Slot Mask, This register is a 2 bit LSB mask on the clock comparator. If both bits are cleared; then the events will assert regardless of the matching state of the LSB bits., frame,0x0: timer works on frame basis, 0x1: invalid, slot,0x2: timer works on slot basis, halfslot,0x3: timer works on half slot basis</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>allow_current_expiry</name>
              <description>Allow current SWT expiry with chained CDT; for CDT Matching mode, SWT configuration for new CDT chaining mode. SWT programming with current native clock values would be considered valid; past expiry_status won't be set. SWT expiry events like TX; RX; HW Abort; and CS still cannot be triggered if programming time half slot is &lt;= current native clock. SWT interrupt will also not get generated at such values (since it is too late). Added for KFOURWONE-2451, 0x0: SWT is configured in original mode where current native clock value is, considered to be in the past, 0x1: SWT is configured in new CDT matching mode where current native clock value is, allowed to trigger chained CDTs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_value_3</name>
          <description>Software Timer 3: Expiration Value</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value, Bluetooth native clock value for event generation. When the Bluetooth native clock equals this value; the events are triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_sts_3</name>
          <description>Software Timer 3: Expiration Status</description>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status, This bit is updated at each expiry. Once set it remains set until this SWT expires again. For the purpose of this register; past value on SWT refers to a value up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed value without any errors, 0x1: SWT was programmed for a value that is in the past</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status, This bit is updated each time the LPO version of nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY be updated with the most accurate value., 0x0: SWT expired at programmed value without any skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration, value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>swt_conf_valid</name>
              <description>SWT Configuration Valid Indication, Indicates when SWT configurations are registered into sleep clock domain Bit is set when configurations are registered in slow domain and reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely registered into slow clock domain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_native_qus</name>
          <description>Native quarter microsecond counter Value</description>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>nat_clock_sleep</name>
              <description>Native quarter microsecond counter Value, This is the quarter miscrosecond timer for FW to read back. The value normally is between 0 to 1249; but it may overflow from this range in sleep mode. This is a read-only register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>nat_clock_sys_valid</name>
              <description>Status bit for Native Clock Value after wakeup , This status bit indicates that the Bluetooth native clock value in BLE_REG_TMR_NATIVE_CLOCK is a valid value after wakeup from SLEEP. SW may read this status bit to confirm that the native clock value read immediately after wakeup is not a stale value. Reset value is zero. This status is set to 0x1 whenever sleep clock value is captured in sysclk. Reset to 0x0 during SLEEP entry as soon as ble_clk_req de-asserts indcating a stale value in BLE_REG_TMR_NATIVE_CLOCK.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_native_clock</name>
          <description>Native mcClock Value</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>nat_clock_sleep</name>
              <description>Native Clock Value, Bluetooth native clock value used for timer comparison. This is the sleep clock version of the Bluetooth native clock. To read-verify after a write; it takes at least 2 sleep clock cycles for the write value to return.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_wakeup_delay_lpo_cycles</name>
          <description>Wakeup delay value in LPO cycles</description>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wakeup_delay_lpo_cycles</name>
              <description>Wakeup delay in LPO cycles, Number of LPO (sleep clock) cycles from btu_clk_req assertion until the clocks are stable. The minimum recommended value is 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_clock_skip</name>
          <description>Native Clock Value</description>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>old_native_clock</name>
              <description>Native Clock Value (before skip), Bluetooth native clock value before the clock skip was observed. The value after skip can be read in the BLE_REG_TMR_NATIVE_CLOCK register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
