nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>btu_rif_ble_pulse_tx_delay</name>
          <description>RIF BLE Pulse Tx Delay</description>
          <addressOffset>0xC32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xD9</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_pulse_tx_delay</name>
              <description>BLE Pulse Tx Delay, Timing Variable from rif_rx_req to BLE Pulse on Tx. Only assert under BLE traffic; and must be less or equal to BTU_RIF_TXPAON[9:0] - 4., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_mode_type</name>
          <description>RIF dBus Rx Mode Type</description>
          <addressOffset>0xC34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_mode_type_enable</name>
              <description>dBus Rx Mode Type Enable, Enable Automatic Sending Rx Mode Type (decoded from packet header) on the dBus., 0x0: disable automatic dbus sending Rx mode type, 0x1: enable automatic dbus sending Rx mode type</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_mode_type_tx_delay</name>
          <description>RIF Mode Type Tx Delay</description>
          <addressOffset>0xC36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x277</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mode_type_tx_delay</name>
              <description>Mode Type Tx Delay, Time from the assertion of modTypeTx to the deassertion of modTypeTx., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_mode_type_rx_delay</name>
          <description>RIF Mode Type Rx Delay</description>
          <addressOffset>0xC38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x82</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mode_type_rx_delay</name>
              <description>Mode Type Rx Delay, Time from the assertion of modTypeRx to the deassertion of modTypeRx. For Gen4; it anchors the end of packet header for Rx sampling., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_pktctl_oe_delay</name>
          <description>RIF Packet Control OE Delay</description>
          <addressOffset>0xC3A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pkt_ctl_oe_delay_modetype</name>
              <description>Packet Control OE Delay Mode Type, Time from the Deassertion of modType to the Deassertion of pktCtl_oe., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pkt_ctl_oe_delay_ppulse</name>
              <description>Packet Control OE Delay P Pulse, Time from the Deassertion of P pulse to the Deasserttion of pktCtl oe., - Resolution: 0.25 us.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pkt_ctl_oe_delay_hdrstart</name>
              <description>Packet Control OE Delay Header Start, Time from the Deassertion of Header Start pulse to the Assertion of pktCtl oe., - Resolution: 0.25 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rf_bypass</name>
              <description>Radio Bypass Mode Used for Baseband to Baseband Testing, When set; it will do two things on pktCtrl_1:, - On Rx slot; it sets output enable as input., - On Tx slot; it generates a sync pulse before payload.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_ctl</name>
          <description>RIF Software dBus Control</description>
          <addressOffset>0xC40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_addr</name>
              <description>dBus register address, BRF register offset address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_size_bytes</name>
              <description>number of bytes to read or write, Burst read or write is supported; a maximum of 8 bytes at once., 0x0: 1 byte, 0x1: 2 bytes, 0x2: 3 bytes, 0x3: 4 bytes, 0x4: 5 byteS, 0x5: 6 bytes, 0x6: 7 bytes, 0x7: 8 bytes</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_start</name>
              <description>Start a new dBus access, A new dBus register access is started when 1 is written to this bit (provided an access is not currently in progress). The read value is always 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>sw_dbus_rd</name>
              <description>Read/write control, 0x0: write, 0x1: read</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_event</name>
          <description>RIF Software dBus Event, - Max burst read or write: 8 bytes.</description>
          <addressOffset>0xC42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_count</name>
              <description>Count to trigger software dBus, Count value used in conjunction with sw_dbus_event; when applicable., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_rst</name>
              <description>software dBus reset, If set; software dBus FSM will reset and transition to idle state. Software dBus finish will be issued. Firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_finished</name>
              <description>Poll status of dBus access, When set; the dBus read or write access is finished. This bit is reset when writing to BTU_RIF_SWDBUS_CTL reg for the next access., 0x0: busy, 0x1: finished</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_dbus_event</name>
              <description>Event to trigger software dBus access, SWDBUS_EVENT_NONPKT,0x0: SWDBUS_EVENT_NONPKT (when there is no packet activity), SWDBUS_EVENT_PKT_ASAP,0x1: SWDBUS_EVENT_PKT_ASAP (as soon as possible during packet activity), SWDBUS_EVENT_PKT_START,0x2: SWDBUS_EVENT_PKT_START (when rif_startCount equals sw_dbus_count), SWDBUS_EVENT_PKT_END,0x3: SWDBUS_EVENT_PKT_END (when rif_endCount equals sw_dbus_count)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_data_1_0</name>
          <description>RIF Software dBus Data_1_0</description>
          <addressOffset>0xC44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata0</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 1st 8-bit word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata1</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 2nd 8-bit word.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_data_3_2</name>
          <description>RIF Software dBus Data_3_2</description>
          <addressOffset>0xC46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata2</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 3rd 8-bit word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata3</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 4th 8-bit word.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_data_5_4</name>
          <description>RIF Software dBus Data_5_4</description>
          <addressOffset>0xC48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata4</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 5th 8-bit word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata5</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 6th 8-bit word.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_swdbus_data_7_6</name>
          <description>RIF Software dBus Data_7_6</description>
          <addressOffset>0xC4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata6</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 7th 8-bit word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata7</name>
              <description>Software Access Data, Set write data (write access); or get the read data (read access)., Updated automatically during read., Bits[7:0] of 8th 8-bit word.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_tx_fesw</name>
          <description>RIF Tx FESW</description>
          <addressOffset>0xC4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9036</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_fesw_on_delay</name>
              <description>Tx FESW On Delay, Number of microseconds from wakeUp to turning on bttx_fesw for Tx packets.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fesw_off_delay</name>
              <description>Tx FESW Off Delay, Number of microseconds from rifTx falling to turning off bttx_fesw.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fesw_en</name>
              <description>Tx Front-End Switch (FESW) Enable, 0x0: bttx_fesw is fixed to 0, 0x1: enable FESW during for Tx packets</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_fesw</name>
          <description>RIF Rx FESW</description>
          <addressOffset>0xC4E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8A15</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fesw_on_delay</name>
              <description>Rx FESW On Delay, Number of microseconds from rif_rx_req to turning on btrx_fesw for Rx packets.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fesw_off_delay</name>
              <description>Rx FESW Off Delay, Number of microseconds from rifRx falling to turning off btrx_fesw.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fesw_en</name>
              <description>Rx FESW Enable, 0x0: btrx_fesw is fixed to 0, 0x1: enable FESW during for Rx packets</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rxpaon</name>
          <description>RIF Rx PA On</description>
          <addressOffset>0xC50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8142</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pa_on_delay</name>
              <description>Rx PA on Delay, Timing Variable from Wakeup (packet boundary) to PA Assertion on Rx Pulse., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_pa_on_en</name>
              <description>Rx PA On Delay Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rx_pu</name>
          <description>RIF BRF Power Up for RX, brf_pu is the sideband signal used to turn on the BRF's power control.</description>
          <addressOffset>0xC52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x227</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_rx_pu_on_delay_qus</name>
              <description>brf_pu on delay, Delay from wakeUp to turning on brf_pu. Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_rx_pu_off_delay_qus</name>
              <description>brf_pu off delay, Delay from last dBus access to turning off brf_pu. Resolution: 0.25 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_rx_pu_fixed</name>
              <description>Set brf_pu to a fixed value., BRF power up value., 0x0: use programmable timers, 0x1: fixed; brf_pu = brf_pu_on_delay_us[0]</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_btc_dbus_tx_pkt_end</name>
          <description>BTC RIF dBus Tx Packet End Control</description>
          <addressOffset>0xC54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_pkt_end_delay</name>
              <description>dBus Tx Packet End Delay, Time from the end of active Tx payload to dBus command that sets the radio back to IDLE., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_tx_pkt_end_enable</name>
              <description>Tx Packet End dBus Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_btc_dbus_rx_pkt_end</name>
          <description>BTC RIF dBus Rx Packet End Control</description>
          <addressOffset>0xC56</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8012</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_pkt_end_delay</name>
              <description>dBus Rx Packet End Delay, Time from the end of active Rx payload to dBus command that sets the radio back to IDLE., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_rx_pkt_end_enable</name>
              <description>Rx Packet End dBus Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_btc_dbus_tx_rampdown</name>
          <description>BTC RIF dBus Tx Rampdown Control</description>
          <addressOffset>0xC58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8008</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_rampdown_delay</name>
              <description>dBus Tx Rampdown Delay, Delay time after the end of a Tx slot for ramping down the radio over the dBus., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_tx_rampdown_enable</name>
              <description>Enables Automatic Rampdown radio after Tx slot on the dBus, 0x0: disable automatic ramping down the radio after Tx slot, 0x1: enable automatic ramping down the radio after Tx slot</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
