nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>btu_rif_dbus_cor_config_ctrl</name>
          <description>RIF Correlator Configuration Control</description>
          <addressOffset>0xC82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8800</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_corcfg_wr_delay</name>
              <description>Rx Mode dBus BRF Correlator Configuration Control Delay, Delay from rif_rx_req to trigger correlator configuration dBus writes., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_prem_det_gate_syncwd_en_ant</name>
              <description>Enable BRF to start syncword detection after preamble found for Ant Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_prem_det_gate_syncwd_en_nike</name>
              <description>Enable BRF to start syncword detection after preamble found for Nike Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_prem_det_gate_syncwd_en_ble</name>
              <description>Enable BRF to start syncword detection after preamble found for BLE Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_corcfg_wr_enable</name>
              <description>Rx Mode dBus BRF Correlator Configuration Transaction Enable, Enable only when using MRVL Gen3 radio.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_cor_config_addr</name>
          <description>RIF BRF Correlator Configuration Address, Only use in MRVL Gen3 Radio Mode.</description>
          <addressOffset>0xC84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x203</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_cor_cfg_addr</name>
              <description>Radio Register Address for Correlator Configuration, Only use in MRVL Gen3 radio mode., The BRF register of the correlator configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_syncwd_acc_code_ctrl</name>
          <description>RIF Syncword and Access Code Send Control</description>
          <addressOffset>0xC86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_syncword_wr_delay</name>
              <description>dBus Syncword and Access Code Control Delay, Delay from rif_rx_req to trigger syncword and access code control dBus writes., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_syncword_wr_enable</name>
              <description>Rx Mode dBus Syncword and Access Code Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_acc_code_one_addr</name>
          <description>RIF BRF Access Code 1 Address</description>
          <addressOffset>0xC88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_acc_code_one_addr</name>
              <description>Radio Register Address for First Access Code, The LSB BRF register of the 1st access code. Since BTC sync word is 64-bit long; the consecutive 8 BRF registers (1 byte each register) are allocated. Correlation hit used this sync word will reflect a PKT_CTL_0 pulse.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_acc_code_two_addr</name>
          <description>RIF Access Code 2 Address</description>
          <addressOffset>0xC8A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x13</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_acc_code_two_addr</name>
              <description>Radio Register Address for Second Access Code, The LSB BRF register of the 2nd access code. Since BTC sync word is 64-bit long; the consecutive 8 BRF registers (1 byte each register) are allocated. Correlation hit used this sync word will reflect a PKT_CTL_1 pulse.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rx_mode_type_addr</name>
          <description>RIF Register</description>
          <addressOffset>0xC8C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1B</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_mode_type_addr</name>
              <description>Radio Register Address for Rx Mode Type, The BRF register of the expected Rx BDR/EDR mode type.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rx_pkt_pld_len_addr</name>
          <description>RIF Register</description>
          <addressOffset>0xC8E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_pld_len_addr</name>
              <description>Radio Register Address for Rx Packet Payload Length, The LSB BRF register of the expected Rx Packet Payload Length. The immediate next BRF registers is also allocated for MSB length portion., - Units: micro-seconds.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_sync_pulse_timer</name>
          <description>RIF BRF Rx Sync Pulse Timer</description>
          <addressOffset>0xC90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E14</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_hdr_pulse_timeout</name>
              <description>Rx Header Pulse Timeout, After correlation hit; timeout counter for the header sync pulse from the BRF. The BRF header start pulse is received when the packet header is sent on rx_data. If the header start pulse is not detected; then the packet would be aborted. This timeout specifies how long the BTU will wait before an abort., - Resolution: 1 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_sync_pulse_timeout</name>
              <description>Rx Sync Pulse Timeout, After header start pulse; timeout counter for the payload sync pulse from the BRF. The BRF payload sync pulse is received when the packet payload is sent on rx_data. If the payload sync pulse is not detected; then the packet would be aborted. This timeout specifies how long the BTU will wait before an abort., - Resolution: 1 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_btc_samp_phase_adj</name>
          <description>RIF Rx Sample Phase Adjustment</description>
          <addressOffset>0xC92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>hdr_start_pos_adj</name>
              <description>Positive Phase Adjustment after Header starts Pulse, Positive phase adjustment after header starts pulse. The sampling point is delayed by the shift amount., - Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hdr_start_neg_adj</name>
              <description>Negative Phase Adjustment after Header starts Pulse, Negative phase adjustment after header starts pulse. The sampling point is advanced by the shift amount., - Resolution: 0.25 us.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_start_pos_adj</name>
              <description>Positive Phase Adjustment after Payload Sync starts Pulse, Positive phase adjustment after payload sync starts pulse. The sampling point is delayed by the shift amount., - Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_start_neg_adj</name>
              <description>Negative Phase Adjustment after Header Starts Pulse, Negative phase adjustment after payload sync starts pulse. The sampling point is advanced by the shift amount., - Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_ble_samp_phase_adj</name>
          <description>RIF Rx Sample Phase Adjustment</description>
          <addressOffset>0xC94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pdu_start_pos_adj</name>
              <description>Positive Phase Adjustment after PDU Data starts Pulse, Positive phase adjustment after PDU data starts pulse. The sampling point is delayed by the shift amount., - Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pdu_start_neg_adj</name>
              <description>Negative Phase Adjustment after PDU Data starts Pulse, Negative phase adjustment after PDU data starts pulse. The sampling point is advanced by the shift amount., - Resolution: 0.25 us.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dfe_1m_phase_pos_adj</name>
              <description>Positive Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase Adjustment for 1 Mbps DFE I/Q samples after CRC. The sampling point is delayed by the shift amount., - Resolution: 62.5 ns (Gen4).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dfe_1m_phase_neg_adj</name>
              <description>Negative Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase Adjustment for 1 Mbps DFE I/Q samples after CRC. The sampling point is advanced by the shift amount., - Resolution: 62.5 ns (Gen4).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dfe_2m_phase_pos_adj</name>
              <description>Positive Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase Adjustment for 2 Mbps DFE I/Q samples after CRC. The sampling point is delayed by the shift amount., - Resolution: 62.5 ns (Gen4).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dfe_2m_phase_neg_adj</name>
              <description>Negative Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase Adjustment for 2 Mbps DFE I/Q samples after CRC. The sampling point is advanced by the shift amount., - Resolution: 62.5 ns (Gen4).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_tone_cancel_ctrl</name>
          <description>Rx Tone Cancellation Control</description>
          <addressOffset>0xC96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_dbus_pull_in_time</name>
              <description>Rx dBUS events pull-in time, This adjusts the pull-in time of the dBUS events including SOC_BT_BRF_PU; A3; A1; A2 and P pulse before Rx packet. This setting applies to both BTC and BLE packet. Resolution: 0.25us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_pull_in_en</name>
              <description>BLE dBUS events pull-in enable, Enable BLE Rx packet dBUS events pull-in when current BLE packet's frequency matches one of the 4 TONE_CANCEL_CHNL values., 0x0: disable, 0x1: enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_tone_cancel_chnl10</name>
          <description>Rx Tone Cancellation Channel</description>
          <addressOffset>0xC98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7F7F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tone_cancel_chnl0</name>
              <description>Rx Tone Cancellation Channel 0, If Rx packet's channel index value sent to BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tone_cancel_chnl1</name>
              <description>Rx Tone Cancellation Channel 1, If Rx packet's channel index value sent to BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rx_tone_cancel_chnl32</name>
          <description>Rx Tone Cancellation Channel</description>
          <addressOffset>0xC9A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7F7F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tone_cancel_chnl2</name>
              <description>Rx Tone Cancellation Channel 2, If Rx packet's channel index value sent to BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tone_cancel_chnl3</name>
              <description>Rx Tone Cancellation Channel 3, If Rx packet's channel index value sent to BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_ctl</name>
          <description>BLE RIF Control</description>
          <addressOffset>0xCA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_brf_pu</name>
              <description>BLE BRF Power up, This bit used by the BLE software to control the power up bit for the BRF., 0x0: disable, 0x1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_pll_req</name>
              <description>BLE PLL Clock Request, This bit is used by the BLE software to control the PLL clock enable., 0x0: disable, 0x1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>data_loopback_en</name>
              <description>BLE Loopback Data Enable, Setting this bit changes the source of the BLE Rx data from the Tx block instead of from the BRF., 0x0: Rx data is from BRF, 0x1: Rx data is from Tx block</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_iq_sample_phase</name>
              <description>BLE Rx IQ Sampling Rate Phase, To use in conjunction with rx_iq_sample_rate[1:0] in 'BLE_REG_DFE_PKT_EXTENSION_CNTRL'; define IQ sample reception phase in Rx extension field., When rx_iq_sample_rate[1:0] == 0; receiving IQ samples every 4 usec; on the phase rx_iq_sample_phase[1:0] herein specified (i.e. 0~3)., When rx_iq_sample_rate[1:0] == 1; receiving IQ samples every 2 usec; on the phase rx_iq_sample_phase[0] herein specified (i.e. 0: on even phase; 1: on odd phase)., When rx_iq_sample_rate[1:0] == 0; receiving IQ samples every 1 usec on every phase; rx_iq_sample_phase[1:0] is ignored.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_tx_pwr_adj_en</name>
              <description>BLE TX power adjust enable, Global enable for BLE Tx power adjustment scheme - outputting Tx_power_level to BCA at bt_req and overwriting with Bfdbk_Tx_power if Bfdbk_Tx_power_ind., 0x0: disable, 0x1: enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_ignore_bca_tx_pwr</name>
              <description>BLE ignore BCA TX power, FW overide to ignore BCA's Bfdbk_Tx_power if Bfdbk_Tx_power_ind; for current BLE Tx pkt., 0x0: disable, 0x1: enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cor_length_sel</name>
          <description>BLE Correlation Length Selection</description>
          <addressOffset>0xCA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_indicator</name>
              <description>BLE Correlator Indicator, BLE correlator indicator to enable which correlator is used., 0x0: no correlator enabled, 0x1: correlator one enabled, 0x2: correlator two enabled, 0x3: both correlators enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cor_accessaddr_0</name>
          <description>BLE AccessCode</description>
          <addressOffset>0xCA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_access_code_0_16</name>
              <description>BLE Access Code, BLE Access Code to be used in correlator for the current Rx packet (lower 16-bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cor_accessaddr_1</name>
          <description>BLE AccessCode</description>
          <addressOffset>0xCA6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_access_code_17_32</name>
              <description>BLE Access Code, BLE Access Code to be used in correlator for the current Rx packet(upper 16-bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
