nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC3/KW43B43ZC3.xml
        <register>
          <name>BTU_PTA_ANT_SWITCH_CTRL</name>
          <description>PTA Antenna Switch Control</description>
          <addressOffset>0xF90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bca_ant_switch_sts_bypass_en</name>
              <description>BCA antenna switch status bypass enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable antSwitchStatus bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable antSwitchStatus bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bca_ant_switch_sts_bypass_val</name>
              <description>BCA antenna switch status bypass value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>set BCA antSwitchStatus to zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>set BCA antSwitchStatus to one</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bca_ref_antenna</name>
              <description>BCA reference antenna override value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bca_ref_antenna_override</name>
              <description>BCA reference antenna override</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable BCA refAntenna override</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable BCA refAntenna override</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_SEL_BCA_PRI_HIGH</name>
          <description>PTA High Priority Select for BCA Arbitration</description>
          <addressOffset>0xFA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>msSwitchPri</name>
              <description>Master / Slave Switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pagePri</name>
              <description>Page</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pScanPri</name>
              <description>Page Scan</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inqPri</name>
              <description>Inquiry</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iScanPri</name>
              <description>Inquiry Scan</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitTxPri</name>
              <description>LLR Initiator Tx priority</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitRxPri</name>
              <description>LLR Initiator Rx priority</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoInstPri</name>
              <description>eSCO Instant</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoRetrPri</name>
              <description>eSCO Retransmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>scoPri</name>
              <description>SCO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>broadcastPri</name>
              <description>Broadcast</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aclPri</name>
              <description>ACL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iRespPri</name>
              <description>Inquiry Response</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slvRespPri</name>
              <description>Slave Page Response</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pollPri</name>
              <description>Poll packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mstrRespPri</name>
              <description>Master Page Response</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_SEL_BCA_PRI_MED</name>
          <description>PTA Medium Priority Select for BCA Arbitration</description>
          <addressOffset>0xFA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>msSwitchPri</name>
              <description>Master / Slave Switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pagePri</name>
              <description>Page</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pScanPri</name>
              <description>Page Scan</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inqPri</name>
              <description>Inquiry</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iScanPri</name>
              <description>Inquiry Scan</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitTxPri</name>
              <description>LLR Initiator Tx priority</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitRxPri</name>
              <description>LLR Initiator Rx priority</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoInstPri</name>
              <description>eSCO Instant</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoRetrPri</name>
              <description>eSCO Retransmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>scoPri</name>
              <description>SCO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>broadcastPri</name>
              <description>Broadcast</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aclPri</name>
              <description>ACL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iRespPri</name>
              <description>Inquiry Response</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slvRespPri</name>
              <description>Slave Page Response</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pollPri</name>
              <description>Poll packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mstrRespPri</name>
              <description>Master Page Response</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
